hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_PINS.h
/*******************************************************************************
* File Name: PC_PSoC_UART_PINS.h
* Version 3.0
*
* Description:
*  This file provides constants and parameter values for the pin components
*  buried into SCB Component.
*
* Note:
*
********************************************************************************
* Copyright 2013-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_SCB_PINS_PC_PSoC_UART_H)
#define CY_SCB_PINS_PC_PSoC_UART_H

#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cytypes.h"


/***************************************
*   Conditional Compilation Parameters
****************************************/

/* Unconfigured pins */
#define PC_PSoC_UART_REMOVE_RX_WAKE_SDA_MOSI_PIN  (1u)
#define PC_PSoC_UART_REMOVE_RX_SDA_MOSI_PIN      (1u)
#define PC_PSoC_UART_REMOVE_TX_SCL_MISO_PIN      (1u)
#define PC_PSoC_UART_REMOVE_CTS_SCLK_PIN      (1u)
#define PC_PSoC_UART_REMOVE_RTS_SS0_PIN      (1u)
#define PC_PSoC_UART_REMOVE_SS1_PIN                 (1u)
#define PC_PSoC_UART_REMOVE_SS2_PIN                 (1u)
#define PC_PSoC_UART_REMOVE_SS3_PIN                 (1u)

/* Mode defined pins */
#define PC_PSoC_UART_REMOVE_I2C_PINS                (1u)
#define PC_PSoC_UART_REMOVE_SPI_MASTER_PINS         (1u)
#define PC_PSoC_UART_REMOVE_SPI_MASTER_SCLK_PIN     (1u)
#define PC_PSoC_UART_REMOVE_SPI_MASTER_MOSI_PIN     (1u)
#define PC_PSoC_UART_REMOVE_SPI_MASTER_MISO_PIN     (1u)
#define PC_PSoC_UART_REMOVE_SPI_MASTER_SS0_PIN      (1u)
#define PC_PSoC_UART_REMOVE_SPI_MASTER_SS1_PIN      (1u)
#define PC_PSoC_UART_REMOVE_SPI_MASTER_SS2_PIN      (1u)
#define PC_PSoC_UART_REMOVE_SPI_MASTER_SS3_PIN      (1u)
#define PC_PSoC_UART_REMOVE_SPI_SLAVE_PINS          (1u)
#define PC_PSoC_UART_REMOVE_SPI_SLAVE_MOSI_PIN      (1u)
#define PC_PSoC_UART_REMOVE_SPI_SLAVE_MISO_PIN      (1u)
#define PC_PSoC_UART_REMOVE_UART_TX_PIN             (0u)
#define PC_PSoC_UART_REMOVE_UART_RX_TX_PIN          (1u)
#define PC_PSoC_UART_REMOVE_UART_RX_PIN             (0u)
#define PC_PSoC_UART_REMOVE_UART_RX_WAKE_PIN        (1u)
#define PC_PSoC_UART_REMOVE_UART_RTS_PIN            (1u)
#define PC_PSoC_UART_REMOVE_UART_CTS_PIN            (1u)

/* Unconfigured pins */
#define PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN (0u == PC_PSoC_UART_REMOVE_RX_WAKE_SDA_MOSI_PIN)
#define PC_PSoC_UART_RX_SDA_MOSI_PIN     (0u == PC_PSoC_UART_REMOVE_RX_SDA_MOSI_PIN)
#define PC_PSoC_UART_TX_SCL_MISO_PIN     (0u == PC_PSoC_UART_REMOVE_TX_SCL_MISO_PIN)
#define PC_PSoC_UART_CTS_SCLK_PIN     (0u == PC_PSoC_UART_REMOVE_CTS_SCLK_PIN)
#define PC_PSoC_UART_RTS_SS0_PIN     (0u == PC_PSoC_UART_REMOVE_RTS_SS0_PIN)
#define PC_PSoC_UART_SS1_PIN                (0u == PC_PSoC_UART_REMOVE_SS1_PIN)
#define PC_PSoC_UART_SS2_PIN                (0u == PC_PSoC_UART_REMOVE_SS2_PIN)
#define PC_PSoC_UART_SS3_PIN                (0u == PC_PSoC_UART_REMOVE_SS3_PIN)

/* Mode defined pins */
#define PC_PSoC_UART_I2C_PINS               (0u == PC_PSoC_UART_REMOVE_I2C_PINS)
#define PC_PSoC_UART_SPI_MASTER_PINS        (0u == PC_PSoC_UART_REMOVE_SPI_MASTER_PINS)
#define PC_PSoC_UART_SPI_MASTER_SCLK_PIN    (0u == PC_PSoC_UART_REMOVE_SPI_MASTER_SCLK_PIN)
#define PC_PSoC_UART_SPI_MASTER_MOSI_PIN    (0u == PC_PSoC_UART_REMOVE_SPI_MASTER_MOSI_PIN)
#define PC_PSoC_UART_SPI_MASTER_MISO_PIN    (0u == PC_PSoC_UART_REMOVE_SPI_MASTER_MISO_PIN)
#define PC_PSoC_UART_SPI_MASTER_SS0_PIN     (0u == PC_PSoC_UART_REMOVE_SPI_MASTER_SS0_PIN)
#define PC_PSoC_UART_SPI_MASTER_SS1_PIN     (0u == PC_PSoC_UART_REMOVE_SPI_MASTER_SS1_PIN)
#define PC_PSoC_UART_SPI_MASTER_SS2_PIN     (0u == PC_PSoC_UART_REMOVE_SPI_MASTER_SS2_PIN)
#define PC_PSoC_UART_SPI_MASTER_SS3_PIN     (0u == PC_PSoC_UART_REMOVE_SPI_MASTER_SS3_PIN)
#define PC_PSoC_UART_SPI_SLAVE_PINS         (0u == PC_PSoC_UART_REMOVE_SPI_SLAVE_PINS)
#define PC_PSoC_UART_SPI_SLAVE_MOSI_PIN     (0u == PC_PSoC_UART_REMOVE_SPI_SLAVE_MOSI_PIN)
#define PC_PSoC_UART_SPI_SLAVE_MISO_PIN     (0u == PC_PSoC_UART_REMOVE_SPI_SLAVE_MISO_PIN)
#define PC_PSoC_UART_UART_TX_PIN            (0u == PC_PSoC_UART_REMOVE_UART_TX_PIN)
#define PC_PSoC_UART_UART_RX_TX_PIN         (0u == PC_PSoC_UART_REMOVE_UART_RX_TX_PIN)
#define PC_PSoC_UART_UART_RX_PIN            (0u == PC_PSoC_UART_REMOVE_UART_RX_PIN)
#define PC_PSoC_UART_UART_RX_WAKE_PIN       (0u == PC_PSoC_UART_REMOVE_UART_RX_WAKE_PIN)
#define PC_PSoC_UART_UART_RTS_PIN           (0u == PC_PSoC_UART_REMOVE_UART_RTS_PIN)
#define PC_PSoC_UART_UART_CTS_PIN           (0u == PC_PSoC_UART_REMOVE_UART_CTS_PIN)


/***************************************
*             Includes
****************************************/

#if (PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN)
    #include "PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi.h"
#endif /* (PC_PSoC_UART_RX_SDA_MOSI) */

#if (PC_PSoC_UART_RX_SDA_MOSI_PIN)
    #include "PC_PSoC_UART_uart_rx_i2c_sda_spi_mosi.h"
#endif /* (PC_PSoC_UART_RX_SDA_MOSI) */

#if (PC_PSoC_UART_TX_SCL_MISO_PIN)
    #include "PC_PSoC_UART_uart_tx_i2c_scl_spi_miso.h"
#endif /* (PC_PSoC_UART_TX_SCL_MISO) */

#if (PC_PSoC_UART_CTS_SCLK_PIN)
    #include "PC_PSoC_UART_uart_cts_spi_sclk.h"
#endif /* (PC_PSoC_UART_CTS_SCLK) */

#if (PC_PSoC_UART_RTS_SS0_PIN)
    #include "PC_PSoC_UART_uart_rts_spi_ss0.h"
#endif /* (PC_PSoC_UART_RTS_SS0_PIN) */

#if (PC_PSoC_UART_SS1_PIN)
    #include "PC_PSoC_UART_spi_ss1.h"
#endif /* (PC_PSoC_UART_SS1_PIN) */

#if (PC_PSoC_UART_SS2_PIN)
    #include "PC_PSoC_UART_spi_ss2.h"
#endif /* (PC_PSoC_UART_SS2_PIN) */

#if (PC_PSoC_UART_SS3_PIN)
    #include "PC_PSoC_UART_spi_ss3.h"
#endif /* (PC_PSoC_UART_SS3_PIN) */

#if (PC_PSoC_UART_I2C_PINS)
    #include "PC_PSoC_UART_scl.h"
    #include "PC_PSoC_UART_sda.h"
#endif /* (PC_PSoC_UART_I2C_PINS) */

#if (PC_PSoC_UART_SPI_MASTER_PINS)
#if (PC_PSoC_UART_SPI_MASTER_SCLK_PIN)
    #include "PC_PSoC_UART_sclk_m.h"
#endif /* (PC_PSoC_UART_SPI_MASTER_SCLK_PIN) */

#if (PC_PSoC_UART_SPI_MASTER_MOSI_PIN)
    #include "PC_PSoC_UART_mosi_m.h"
#endif /* (PC_PSoC_UART_SPI_MASTER_MOSI_PIN) */

