hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_PINS.h
#if (PC_PSoC_UART_SPI_MASTER_MISO_PIN)
    #include "PC_PSoC_UART_miso_m.h"
#endif /*(PC_PSoC_UART_SPI_MASTER_MISO_PIN) */
#endif /* (PC_PSoC_UART_SPI_MASTER_PINS) */

#if (PC_PSoC_UART_SPI_SLAVE_PINS)
    #include "PC_PSoC_UART_sclk_s.h"
    #include "PC_PSoC_UART_ss_s.h"

#if (PC_PSoC_UART_SPI_SLAVE_MOSI_PIN)
    #include "PC_PSoC_UART_mosi_s.h"
#endif /* (PC_PSoC_UART_SPI_SLAVE_MOSI_PIN) */

#if (PC_PSoC_UART_SPI_SLAVE_MISO_PIN)
    #include "PC_PSoC_UART_miso_s.h"
#endif /*(PC_PSoC_UART_SPI_SLAVE_MISO_PIN) */
#endif /* (PC_PSoC_UART_SPI_SLAVE_PINS) */

#if (PC_PSoC_UART_SPI_MASTER_SS0_PIN)
    #include "PC_PSoC_UART_ss0_m.h"
#endif /* (PC_PSoC_UART_SPI_MASTER_SS0_PIN) */

#if (PC_PSoC_UART_SPI_MASTER_SS1_PIN)
    #include "PC_PSoC_UART_ss1_m.h"
#endif /* (PC_PSoC_UART_SPI_MASTER_SS1_PIN) */

#if (PC_PSoC_UART_SPI_MASTER_SS2_PIN)
    #include "PC_PSoC_UART_ss2_m.h"
#endif /* (PC_PSoC_UART_SPI_MASTER_SS2_PIN) */

#if (PC_PSoC_UART_SPI_MASTER_SS3_PIN)
    #include "PC_PSoC_UART_ss3_m.h"
#endif /* (PC_PSoC_UART_SPI_MASTER_SS3_PIN) */

#if (PC_PSoC_UART_UART_TX_PIN)
    #include "PC_PSoC_UART_tx.h"
#endif /* (PC_PSoC_UART_UART_TX_PIN) */

#if (PC_PSoC_UART_UART_RX_TX_PIN)
    #include "PC_PSoC_UART_rx_tx.h"
#endif /* (PC_PSoC_UART_UART_RX_TX_PIN) */

#if (PC_PSoC_UART_UART_RX_PIN)
    #include "PC_PSoC_UART_rx.h"
#endif /* (PC_PSoC_UART_UART_RX_PIN) */

#if (PC_PSoC_UART_UART_RX_WAKE_PIN)
    #include "PC_PSoC_UART_rx_wake.h"
#endif /* (PC_PSoC_UART_UART_RX_WAKE_PIN) */

#if (PC_PSoC_UART_UART_RTS_PIN)
    #include "PC_PSoC_UART_rts.h"
#endif /* (PC_PSoC_UART_UART_RTS_PIN) */

#if (PC_PSoC_UART_UART_CTS_PIN)
    #include "PC_PSoC_UART_cts.h"
#endif /* (PC_PSoC_UART_UART_CTS_PIN) */


/***************************************
*              Registers
***************************************/

#if (PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN)
    #define PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG \
                            (*(reg32 *) PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi__0__HSIOM)
    #define PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_PTR \
                            ( (reg32 *) PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi__0__HSIOM)
    #define PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_MASK \
                            (PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi__0__HSIOM_MASK)
    #define PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_POS \
                            (PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi__0__HSIOM_SHIFT)

    #define PC_PSoC_UART_RX_WAKE_SDA_MOSI_INTCFG_REG \
                            (*(reg32 *) PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi__0__INTCFG)
    #define PC_PSoC_UART_RX_WAKE_SDA_MOSI_INTCFG_PTR \
                            ( (reg32 *) PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi__0__INTCFG)
    #define PC_PSoC_UART_RX_WAKE_SDA_MOSI_INTCFG_TYPE_POS  (PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi__SHIFT)
    #define PC_PSoC_UART_RX_WAKE_SDA_MOSI_INTCFG_TYPE_MASK \
                            ((uint32) PC_PSoC_UART_INTCFG_TYPE_MASK << \
                                      PC_PSoC_UART_RX_WAKE_SDA_MOSI_INTCFG_TYPE_POS)
#endif /* (PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN) */

#if (PC_PSoC_UART_RX_SDA_MOSI_PIN)
    #define PC_PSoC_UART_RX_SDA_MOSI_HSIOM_REG   (*(reg32 *) PC_PSoC_UART_uart_rx_i2c_sda_spi_mosi__0__HSIOM)
    #define PC_PSoC_UART_RX_SDA_MOSI_HSIOM_PTR   ( (reg32 *) PC_PSoC_UART_uart_rx_i2c_sda_spi_mosi__0__HSIOM)
    #define PC_PSoC_UART_RX_SDA_MOSI_HSIOM_MASK  (PC_PSoC_UART_uart_rx_i2c_sda_spi_mosi__0__HSIOM_MASK)
    #define PC_PSoC_UART_RX_SDA_MOSI_HSIOM_POS   (PC_PSoC_UART_uart_rx_i2c_sda_spi_mosi__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_RX_SDA_MOSI_PIN) */

#if (PC_PSoC_UART_TX_SCL_MISO_PIN)
    #define PC_PSoC_UART_TX_SCL_MISO_HSIOM_REG   (*(reg32 *) PC_PSoC_UART_uart_tx_i2c_scl_spi_miso__0__HSIOM)
    #define PC_PSoC_UART_TX_SCL_MISO_HSIOM_PTR   ( (reg32 *) PC_PSoC_UART_uart_tx_i2c_scl_spi_miso__0__HSIOM)
    #define PC_PSoC_UART_TX_SCL_MISO_HSIOM_MASK  (PC_PSoC_UART_uart_tx_i2c_scl_spi_miso__0__HSIOM_MASK)
    #define PC_PSoC_UART_TX_SCL_MISO_HSIOM_POS   (PC_PSoC_UART_uart_tx_i2c_scl_spi_miso__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_TX_SCL_MISO_PIN) */

#if (PC_PSoC_UART_CTS_SCLK_PIN)
    #define PC_PSoC_UART_CTS_SCLK_HSIOM_REG   (*(reg32 *) PC_PSoC_UART_uart_cts_spi_sclk__0__HSIOM)
    #define PC_PSoC_UART_CTS_SCLK_HSIOM_PTR   ( (reg32 *) PC_PSoC_UART_uart_cts_spi_sclk__0__HSIOM)
    #define PC_PSoC_UART_CTS_SCLK_HSIOM_MASK  (PC_PSoC_UART_uart_cts_spi_sclk__0__HSIOM_MASK)
    #define PC_PSoC_UART_CTS_SCLK_HSIOM_POS   (PC_PSoC_UART_uart_cts_spi_sclk__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_CTS_SCLK_PIN) */

#if (PC_PSoC_UART_RTS_SS0_PIN)
    #define PC_PSoC_UART_RTS_SS0_HSIOM_REG   (*(reg32 *) PC_PSoC_UART_uart_rts_spi_ss0__0__HSIOM)
    #define PC_PSoC_UART_RTS_SS0_HSIOM_PTR   ( (reg32 *) PC_PSoC_UART_uart_rts_spi_ss0__0__HSIOM)
    #define PC_PSoC_UART_RTS_SS0_HSIOM_MASK  (PC_PSoC_UART_uart_rts_spi_ss0__0__HSIOM_MASK)
    #define PC_PSoC_UART_RTS_SS0_HSIOM_POS   (PC_PSoC_UART_uart_rts_spi_ss0__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_RTS_SS0_PIN) */

#if (PC_PSoC_UART_SS1_PIN)
    #define PC_PSoC_UART_SS1_HSIOM_REG      (*(reg32 *) PC_PSoC_UART_spi_ss1__0__HSIOM)
    #define PC_PSoC_UART_SS1_HSIOM_PTR      ( (reg32 *) PC_PSoC_UART_spi_ss1__0__HSIOM)
    #define PC_PSoC_UART_SS1_HSIOM_MASK     (PC_PSoC_UART_spi_ss1__0__HSIOM_MASK)
    #define PC_PSoC_UART_SS1_HSIOM_POS      (PC_PSoC_UART_spi_ss1__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_SS1_PIN) */

#if (PC_PSoC_UART_SS2_PIN)
    #define PC_PSoC_UART_SS2_HSIOM_REG     (*(reg32 *) PC_PSoC_UART_spi_ss2__0__HSIOM)
    #define PC_PSoC_UART_SS2_HSIOM_PTR     ( (reg32 *) PC_PSoC_UART_spi_ss2__0__HSIOM)
    #define PC_PSoC_UART_SS2_HSIOM_MASK    (PC_PSoC_UART_spi_ss2__0__HSIOM_MASK)
    #define PC_PSoC_UART_SS2_HSIOM_POS     (PC_PSoC_UART_spi_ss2__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_SS2_PIN) */

#if (PC_PSoC_UART_SS3_PIN)
    #define PC_PSoC_UART_SS3_HSIOM_REG     (*(reg32 *) PC_PSoC_UART_spi_ss3__0__HSIOM)
    #define PC_PSoC_UART_SS3_HSIOM_PTR     ( (reg32 *) PC_PSoC_UART_spi_ss3__0__HSIOM)
    #define PC_PSoC_UART_SS3_HSIOM_MASK    (PC_PSoC_UART_spi_ss3__0__HSIOM_MASK)
    #define PC_PSoC_UART_SS3_HSIOM_POS     (PC_PSoC_UART_spi_ss3__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_SS3_PIN) */

#if (PC_PSoC_UART_I2C_PINS)
    #define PC_PSoC_UART_SCL_HSIOM_REG     (*(reg32 *) PC_PSoC_UART_scl__0__HSIOM)
    #define PC_PSoC_UART_SCL_HSIOM_PTR     ( (reg32 *) PC_PSoC_UART_scl__0__HSIOM)
    #define PC_PSoC_UART_SCL_HSIOM_MASK    (PC_PSoC_UART_scl__0__HSIOM_MASK)
    #define PC_PSoC_UART_SCL_HSIOM_POS     (PC_PSoC_UART_scl__0__HSIOM_SHIFT)

    #define PC_PSoC_UART_SDA_HSIOM_REG     (*(reg32 *) PC_PSoC_UART_sda__0__HSIOM)
    #define PC_PSoC_UART_SDA_HSIOM_PTR     ( (reg32 *) PC_PSoC_UART_sda__0__HSIOM)
    #define PC_PSoC_UART_SDA_HSIOM_MASK    (PC_PSoC_UART_sda__0__HSIOM_MASK)
    #define PC_PSoC_UART_SDA_HSIOM_POS     (PC_PSoC_UART_sda__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_I2C_PINS) */

#if (PC_PSoC_UART_SPI_MASTER_SCLK_PIN)
    #define PC_PSoC_UART_SCLK_M_HSIOM_REG   (*(reg32 *) PC_PSoC_UART_sclk_m__0__HSIOM)
    #define PC_PSoC_UART_SCLK_M_HSIOM_PTR   ( (reg32 *) PC_PSoC_UART_sclk_m__0__HSIOM)
    #define PC_PSoC_UART_SCLK_M_HSIOM_MASK  (PC_PSoC_UART_sclk_m__0__HSIOM_MASK)
    #define PC_PSoC_UART_SCLK_M_HSIOM_POS   (PC_PSoC_UART_sclk_m__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_SPI_MASTER_SCLK_PIN) */

#if (PC_PSoC_UART_SPI_MASTER_SS0_PIN)
    #define PC_PSoC_UART_SS0_M_HSIOM_REG    (*(reg32 *) PC_PSoC_UART_ss0_m__0__HSIOM)
    #define PC_PSoC_UART_SS0_M_HSIOM_PTR    ( (reg32 *) PC_PSoC_UART_ss0_m__0__HSIOM)
    #define PC_PSoC_UART_SS0_M_HSIOM_MASK   (PC_PSoC_UART_ss0_m__0__HSIOM_MASK)
    #define PC_PSoC_UART_SS0_M_HSIOM_POS    (PC_PSoC_UART_ss0_m__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_SPI_MASTER_SS0_PIN) */

#if (PC_PSoC_UART_SPI_MASTER_SS1_PIN)
    #define PC_PSoC_UART_SS1_M_HSIOM_REG    (*(reg32 *) PC_PSoC_UART_ss1_m__0__HSIOM)
    #define PC_PSoC_UART_SS1_M_HSIOM_PTR    ( (reg32 *) PC_PSoC_UART_ss1_m__0__HSIOM)
    #define PC_PSoC_UART_SS1_M_HSIOM_MASK   (PC_PSoC_UART_ss1_m__0__HSIOM_MASK)
    #define PC_PSoC_UART_SS1_M_HSIOM_POS    (PC_PSoC_UART_ss1_m__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_SPI_MASTER_SS1_PIN) */

#if (PC_PSoC_UART_SPI_MASTER_SS2_PIN)
    #define PC_PSoC_UART_SS2_M_HSIOM_REG    (*(reg32 *) PC_PSoC_UART_ss2_m__0__HSIOM)
    #define PC_PSoC_UART_SS2_M_HSIOM_PTR    ( (reg32 *) PC_PSoC_UART_ss2_m__0__HSIOM)
    #define PC_PSoC_UART_SS2_M_HSIOM_MASK   (PC_PSoC_UART_ss2_m__0__HSIOM_MASK)
    #define PC_PSoC_UART_SS2_M_HSIOM_POS    (PC_PSoC_UART_ss2_m__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_SPI_MASTER_SS2_PIN) */

