hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_PINS.h
#if (PC_PSoC_UART_SPI_MASTER_SS3_PIN)
    #define PC_PSoC_UART_SS3_M_HSIOM_REG    (*(reg32 *) PC_PSoC_UART_ss3_m__0__HSIOM)
    #define PC_PSoC_UART_SS3_M_HSIOM_PTR    ( (reg32 *) PC_PSoC_UART_ss3_m__0__HSIOM)
    #define PC_PSoC_UART_SS3_M_HSIOM_MASK   (PC_PSoC_UART_ss3_m__0__HSIOM_MASK)
    #define PC_PSoC_UART_SS3_M_HSIOM_POS    (PC_PSoC_UART_ss3_m__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_SPI_MASTER_SS3_PIN) */

#if (PC_PSoC_UART_UART_TX_PIN)
    #define PC_PSoC_UART_TX_HSIOM_REG   (*(reg32 *) PC_PSoC_UART_tx__0__HSIOM)
    #define PC_PSoC_UART_TX_HSIOM_PTR   ( (reg32 *) PC_PSoC_UART_tx_0__HSIOM)
    #define PC_PSoC_UART_TX_HSIOM_MASK  (PC_PSoC_UART_tx__0__HSIOM_MASK)
    #define PC_PSoC_UART_TX_HSIOM_POS   (PC_PSoC_UART_tx__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_UART_TX_PIN) */

#if (PC_PSoC_UART_UART_RTS_PIN)
    #define PC_PSoC_UART_RTS_HSIOM_REG  (*(reg32 *) PC_PSoC_UART_rts__0__HSIOM)
    #define PC_PSoC_UART_RTS_HSIOM_PTR  ( (reg32 *) PC_PSoC_UART_rts__0__HSIOM)
    #define PC_PSoC_UART_RTS_HSIOM_MASK (PC_PSoC_UART_rts__0__HSIOM_MASK)
    #define PC_PSoC_UART_RTS_HSIOM_POS  (PC_PSoC_UART_rts__0__HSIOM_SHIFT)
#endif /* (PC_PSoC_UART_UART_RTS_PIN) */


/***************************************
*        Registers Constants
***************************************/

/* Pins constants */
#define PC_PSoC_UART_HSIOM_DEF_SEL      (0x00u)
#define PC_PSoC_UART_HSIOM_GPIO_SEL     (0x00u)
#define PC_PSoC_UART_HSIOM_UART_SEL     (0x09u)
#define PC_PSoC_UART_HSIOM_I2C_SEL      (0x0Eu)
#define PC_PSoC_UART_HSIOM_SPI_SEL      (0x0Fu)

#define PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN_INDEX   (0u)
#define PC_PSoC_UART_RX_SDA_MOSI_PIN_INDEX       (0u)
#define PC_PSoC_UART_TX_SCL_MISO_PIN_INDEX       (1u)
#define PC_PSoC_UART_CTS_SCLK_PIN_INDEX       (2u)
#define PC_PSoC_UART_RTS_SS0_PIN_INDEX       (3u)
#define PC_PSoC_UART_SS1_PIN_INDEX                  (4u)
#define PC_PSoC_UART_SS2_PIN_INDEX                  (5u)
#define PC_PSoC_UART_SS3_PIN_INDEX                  (6u)

#define PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN_MASK ((uint32) 0x01u << PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN_INDEX)
#define PC_PSoC_UART_RX_SDA_MOSI_PIN_MASK     ((uint32) 0x01u << PC_PSoC_UART_RX_SDA_MOSI_PIN_INDEX)
#define PC_PSoC_UART_TX_SCL_MISO_PIN_MASK     ((uint32) 0x01u << PC_PSoC_UART_TX_SCL_MISO_PIN_INDEX)
#define PC_PSoC_UART_CTS_SCLK_PIN_MASK     ((uint32) 0x01u << PC_PSoC_UART_CTS_SCLK_PIN_INDEX)
#define PC_PSoC_UART_RTS_SS0_PIN_MASK     ((uint32) 0x01u << PC_PSoC_UART_RTS_SS0_PIN_INDEX)
#define PC_PSoC_UART_SS1_PIN_MASK                ((uint32) 0x01u << PC_PSoC_UART_SS1_PIN_INDEX)
#define PC_PSoC_UART_SS2_PIN_MASK                ((uint32) 0x01u << PC_PSoC_UART_SS2_PIN_INDEX)
#define PC_PSoC_UART_SS3_PIN_MASK                ((uint32) 0x01u << PC_PSoC_UART_SS3_PIN_INDEX)

/* Pin interrupt constants */
#define PC_PSoC_UART_INTCFG_TYPE_MASK           (0x03u)
#define PC_PSoC_UART_INTCFG_TYPE_FALLING_EDGE   (0x02u)

/* Pin Drive Mode constants */
#define PC_PSoC_UART_PIN_DM_ALG_HIZ  (0u)
#define PC_PSoC_UART_PIN_DM_DIG_HIZ  (1u)
#define PC_PSoC_UART_PIN_DM_OD_LO    (4u)
#define PC_PSoC_UART_PIN_DM_STRONG   (6u)


/***************************************
*          Macro Definitions
***************************************/

/* Return drive mode of the pin */
#define PC_PSoC_UART_DM_MASK    (0x7u)
#define PC_PSoC_UART_DM_SIZE    (3)
#define PC_PSoC_UART_GET_P4_PIN_DM(reg, pos) \
    ( ((reg) & (uint32) ((uint32) PC_PSoC_UART_DM_MASK << (PC_PSoC_UART_DM_SIZE * (pos)))) >> \
                                                              (PC_PSoC_UART_DM_SIZE * (pos)) )

#if (PC_PSoC_UART_TX_SCL_MISO_PIN)
    #define PC_PSoC_UART_CHECK_TX_SCL_MISO_PIN_USED \
                (PC_PSoC_UART_PIN_DM_ALG_HIZ != \
                    PC_PSoC_UART_GET_P4_PIN_DM(PC_PSoC_UART_uart_tx_i2c_scl_spi_miso_PC, \
                                                   PC_PSoC_UART_uart_tx_i2c_scl_spi_miso_SHIFT))
#endif /* (PC_PSoC_UART_TX_SCL_MISO_PIN) */

#if (PC_PSoC_UART_RTS_SS0_PIN)
    #define PC_PSoC_UART_CHECK_RTS_SS0_PIN_USED \
                (PC_PSoC_UART_PIN_DM_ALG_HIZ != \
                    PC_PSoC_UART_GET_P4_PIN_DM(PC_PSoC_UART_uart_rts_spi_ss0_PC, \
                                                   PC_PSoC_UART_uart_rts_spi_ss0_SHIFT))
#endif /* (PC_PSoC_UART_RTS_SS0_PIN) */

/* Set bits-mask in register */
#define PC_PSoC_UART_SET_REGISTER_BITS(reg, mask, pos, mode) \
                    do                                           \
                    {                                            \
                        (reg) = (((reg) & ((uint32) ~(uint32) (mask))) | ((uint32) ((uint32) (mode) << (pos)))); \
                    }while(0)

/* Set bit in the register */
#define PC_PSoC_UART_SET_REGISTER_BIT(reg, mask, val) \
                    ((val) ? ((reg) |= (mask)) : ((reg) &= ((uint32) ~((uint32) (mask)))))

#define PC_PSoC_UART_SET_HSIOM_SEL(reg, mask, pos, sel) PC_PSoC_UART_SET_REGISTER_BITS(reg, mask, pos, sel)
#define PC_PSoC_UART_SET_INCFG_TYPE(reg, mask, pos, intType) \
                                                        PC_PSoC_UART_SET_REGISTER_BITS(reg, mask, pos, intType)
#define PC_PSoC_UART_SET_INP_DIS(reg, mask, val) PC_PSoC_UART_SET_REGISTER_BIT(reg, mask, val)

/* PC_PSoC_UART_SET_I2C_SCL_DR(val) - Sets I2C SCL DR register.
*  PC_PSoC_UART_SET_I2C_SCL_HSIOM_SEL(sel) - Sets I2C SCL HSIOM settings.
*/
/* SCB I2C: scl signal */
#if (PC_PSoC_UART_CY_SCBIP_V0)
#if (PC_PSoC_UART_I2C_PINS)
    #define PC_PSoC_UART_SET_I2C_SCL_DR(val) PC_PSoC_UART_scl_Write(val)

    #define PC_PSoC_UART_SET_I2C_SCL_HSIOM_SEL(sel) \
                          PC_PSoC_UART_SET_HSIOM_SEL(PC_PSoC_UART_SCL_HSIOM_REG,  \
                                                         PC_PSoC_UART_SCL_HSIOM_MASK, \
                                                         PC_PSoC_UART_SCL_HSIOM_POS,  \
                                                         (sel))
    #define PC_PSoC_UART_WAIT_SCL_SET_HIGH  (0u == PC_PSoC_UART_scl_Read())

/* Unconfigured SCB: scl signal */
#elif (PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN)
    #define PC_PSoC_UART_SET_I2C_SCL_DR(val) \
                            PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi_Write(val)

    #define PC_PSoC_UART_SET_I2C_SCL_HSIOM_SEL(sel) \
                    PC_PSoC_UART_SET_HSIOM_SEL(PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG,  \
                                                   PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_MASK, \
                                                   PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_POS,  \
                                                   (sel))

    #define PC_PSoC_UART_WAIT_SCL_SET_HIGH  (0u == PC_PSoC_UART_uart_rx_wake_i2c_sda_spi_mosi_Read())

#elif (PC_PSoC_UART_RX_SDA_MOSI_PIN)
    #define PC_PSoC_UART_SET_I2C_SCL_DR(val) \
                            PC_PSoC_UART_uart_rx_i2c_sda_spi_mosi_Write(val)


    #define PC_PSoC_UART_SET_I2C_SCL_HSIOM_SEL(sel) \
                            PC_PSoC_UART_SET_HSIOM_SEL(PC_PSoC_UART_RX_SDA_MOSI_HSIOM_REG,  \
                                                           PC_PSoC_UART_RX_SDA_MOSI_HSIOM_MASK, \
                                                           PC_PSoC_UART_RX_SDA_MOSI_HSIOM_POS,  \
                                                           (sel))

    #define PC_PSoC_UART_WAIT_SCL_SET_HIGH  (0u == PC_PSoC_UART_uart_rx_i2c_sda_spi_mosi_Read())

#else
    #define PC_PSoC_UART_SET_I2C_SCL_DR(val) \
                                                    do{ /* Does nothing */ }while(0)
    #define PC_PSoC_UART_SET_I2C_SCL_HSIOM_SEL(sel) \
                                                    do{ /* Does nothing */ }while(0)

    #define PC_PSoC_UART_WAIT_SCL_SET_HIGH  (0u)
#endif /* (PC_PSoC_UART_I2C_PINS) */

