hkao13/electronic_derailleur/Documents/PSoC Creator/Shifter/Switches.cydsn/Generated_Source/PSoC4/PC_PSoC_UART_PINS.h
/* SCB I2C: sda signal */
#if (PC_PSoC_UART_I2C_PINS)
    #define PC_PSoC_UART_WAIT_SDA_SET_HIGH  (0u == PC_PSoC_UART_sda_Read())
/* Unconfigured SCB: sda signal */
#elif (PC_PSoC_UART_TX_SCL_MISO_PIN)
    #define PC_PSoC_UART_WAIT_SDA_SET_HIGH  (0u == PC_PSoC_UART_uart_tx_i2c_scl_spi_miso_Read())
#else
    #define PC_PSoC_UART_WAIT_SDA_SET_HIGH  (0u)
#endif /* (PC_PSoC_UART_MOSI_SCL_RX_PIN) */
#endif /* (PC_PSoC_UART_CY_SCBIP_V0) */


/***************************************
* The following code is DEPRECATED and
* must not be used.
***************************************/

/* Unconfigured pins */
#define PC_PSoC_UART_REMOVE_MOSI_SCL_RX_WAKE_PIN    PC_PSoC_UART_REMOVE_RX_WAKE_SDA_MOSI_PIN
#define PC_PSoC_UART_REMOVE_MOSI_SCL_RX_PIN         PC_PSoC_UART_REMOVE_RX_SDA_MOSI_PIN
#define PC_PSoC_UART_REMOVE_MISO_SDA_TX_PIN         PC_PSoC_UART_REMOVE_TX_SCL_MISO_PIN
#ifndef PC_PSoC_UART_REMOVE_SCLK_PIN
#define PC_PSoC_UART_REMOVE_SCLK_PIN                PC_PSoC_UART_REMOVE_CTS_SCLK_PIN
#endif /* PC_PSoC_UART_REMOVE_SCLK_PIN */
#ifndef PC_PSoC_UART_REMOVE_SS0_PIN
#define PC_PSoC_UART_REMOVE_SS0_PIN                 PC_PSoC_UART_REMOVE_RTS_SS0_PIN
#endif /* PC_PSoC_UART_REMOVE_SS0_PIN */

/* Unconfigured pins */
#define PC_PSoC_UART_MOSI_SCL_RX_WAKE_PIN   PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN
#define PC_PSoC_UART_MOSI_SCL_RX_PIN        PC_PSoC_UART_RX_SDA_MOSI_PIN
#define PC_PSoC_UART_MISO_SDA_TX_PIN        PC_PSoC_UART_TX_SCL_MISO_PIN
#ifndef PC_PSoC_UART_SCLK_PIN
#define PC_PSoC_UART_SCLK_PIN               PC_PSoC_UART_CTS_SCLK_PIN
#endif /* PC_PSoC_UART_SCLK_PIN */
#ifndef PC_PSoC_UART_SS0_PIN
#define PC_PSoC_UART_SS0_PIN                PC_PSoC_UART_RTS_SS0_PIN
#endif /* PC_PSoC_UART_SS0_PIN */

#if (PC_PSoC_UART_MOSI_SCL_RX_WAKE_PIN)
    #define PC_PSoC_UART_MOSI_SCL_RX_WAKE_HSIOM_REG     PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG
    #define PC_PSoC_UART_MOSI_SCL_RX_WAKE_HSIOM_PTR     PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG
    #define PC_PSoC_UART_MOSI_SCL_RX_WAKE_HSIOM_MASK    PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG
    #define PC_PSoC_UART_MOSI_SCL_RX_WAKE_HSIOM_POS     PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG

    #define PC_PSoC_UART_MOSI_SCL_RX_WAKE_INTCFG_REG    PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG
    #define PC_PSoC_UART_MOSI_SCL_RX_WAKE_INTCFG_PTR    PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG

    #define PC_PSoC_UART_MOSI_SCL_RX_WAKE_INTCFG_TYPE_POS   PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG
    #define PC_PSoC_UART_MOSI_SCL_RX_WAKE_INTCFG_TYPE_MASK  PC_PSoC_UART_RX_WAKE_SDA_MOSI_HSIOM_REG
#endif /* (PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN) */

#if (PC_PSoC_UART_MOSI_SCL_RX_PIN)
    #define PC_PSoC_UART_MOSI_SCL_RX_HSIOM_REG      PC_PSoC_UART_RX_SDA_MOSI_HSIOM_REG
    #define PC_PSoC_UART_MOSI_SCL_RX_HSIOM_PTR      PC_PSoC_UART_RX_SDA_MOSI_HSIOM_PTR
    #define PC_PSoC_UART_MOSI_SCL_RX_HSIOM_MASK     PC_PSoC_UART_RX_SDA_MOSI_HSIOM_MASK
    #define PC_PSoC_UART_MOSI_SCL_RX_HSIOM_POS      PC_PSoC_UART_RX_SDA_MOSI_HSIOM_POS
#endif /* (PC_PSoC_UART_MOSI_SCL_RX_PIN) */

#if (PC_PSoC_UART_MISO_SDA_TX_PIN)
    #define PC_PSoC_UART_MISO_SDA_TX_HSIOM_REG      PC_PSoC_UART_TX_SCL_MISO_HSIOM_REG
    #define PC_PSoC_UART_MISO_SDA_TX_HSIOM_PTR      PC_PSoC_UART_TX_SCL_MISO_HSIOM_REG
    #define PC_PSoC_UART_MISO_SDA_TX_HSIOM_MASK     PC_PSoC_UART_TX_SCL_MISO_HSIOM_REG
    #define PC_PSoC_UART_MISO_SDA_TX_HSIOM_POS      PC_PSoC_UART_TX_SCL_MISO_HSIOM_REG
#endif /* (PC_PSoC_UART_MISO_SDA_TX_PIN_PIN) */

#if (PC_PSoC_UART_SCLK_PIN)
    #ifndef PC_PSoC_UART_SCLK_HSIOM_REG
    #define PC_PSoC_UART_SCLK_HSIOM_REG     PC_PSoC_UART_CTS_SCLK_HSIOM_REG
    #define PC_PSoC_UART_SCLK_HSIOM_PTR     PC_PSoC_UART_CTS_SCLK_HSIOM_PTR
    #define PC_PSoC_UART_SCLK_HSIOM_MASK    PC_PSoC_UART_CTS_SCLK_HSIOM_MASK
    #define PC_PSoC_UART_SCLK_HSIOM_POS     PC_PSoC_UART_CTS_SCLK_HSIOM_POS
    #endif /* PC_PSoC_UART_SCLK_HSIOM_REG */
#endif /* (PC_PSoC_UART_SCLK_PIN) */

#if (PC_PSoC_UART_SS0_PIN)
    #ifndef PC_PSoC_UART_SS0_HSIOM_REG
    #define PC_PSoC_UART_SS0_HSIOM_REG      PC_PSoC_UART_RTS_SS0_HSIOM_REG
    #define PC_PSoC_UART_SS0_HSIOM_PTR      PC_PSoC_UART_RTS_SS0_HSIOM_PTR
    #define PC_PSoC_UART_SS0_HSIOM_MASK     PC_PSoC_UART_RTS_SS0_HSIOM_MASK
    #define PC_PSoC_UART_SS0_HSIOM_POS      PC_PSoC_UART_RTS_SS0_HSIOM_POS
    #endif /* PC_PSoC_UART_SS0_HSIOM_REG */
#endif /* (PC_PSoC_UART_SS0_PIN) */

#define PC_PSoC_UART_MOSI_SCL_RX_WAKE_PIN_INDEX PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN_INDEX
#define PC_PSoC_UART_MOSI_SCL_RX_PIN_INDEX      PC_PSoC_UART_RX_SDA_MOSI_PIN_INDEX
#define PC_PSoC_UART_MISO_SDA_TX_PIN_INDEX      PC_PSoC_UART_TX_SCL_MISO_PIN_INDEX
#ifndef PC_PSoC_UART_SCLK_PIN_INDEX
#define PC_PSoC_UART_SCLK_PIN_INDEX             PC_PSoC_UART_CTS_SCLK_PIN_INDEX
#endif /* PC_PSoC_UART_SCLK_PIN_INDEX */
#ifndef PC_PSoC_UART_SS0_PIN_INDEX
#define PC_PSoC_UART_SS0_PIN_INDEX              PC_PSoC_UART_RTS_SS0_PIN_INDEX
#endif /* PC_PSoC_UART_SS0_PIN_INDEX */

#define PC_PSoC_UART_MOSI_SCL_RX_WAKE_PIN_MASK PC_PSoC_UART_RX_WAKE_SDA_MOSI_PIN_MASK
#define PC_PSoC_UART_MOSI_SCL_RX_PIN_MASK      PC_PSoC_UART_RX_SDA_MOSI_PIN_MASK
#define PC_PSoC_UART_MISO_SDA_TX_PIN_MASK      PC_PSoC_UART_TX_SCL_MISO_PIN_MASK
#ifndef PC_PSoC_UART_SCLK_PIN_MASK
#define PC_PSoC_UART_SCLK_PIN_MASK             PC_PSoC_UART_CTS_SCLK_PIN_MASK
#endif /* PC_PSoC_UART_SCLK_PIN_MASK */
#ifndef PC_PSoC_UART_SS0_PIN_MASK
#define PC_PSoC_UART_SS0_PIN_MASK              PC_PSoC_UART_RTS_SS0_PIN_MASK
#endif /* PC_PSoC_UART_SS0_PIN_MASK */

#endif /* (CY_SCB_PINS_PC_PSoC_UART_H) */


/* [] END OF FILE */
